const List<int> yearList = [2018, 2019, 2020, 2021, 2022];
const List<String> yearLists = ['2018', '2019', '2020', '2021', '2022'];
const List<String> departureList = ['普通科', '探究科'];
const List<String> eventNameList = ['信州学', '個人探究'];
const List<String> categoryList = <String>[
  '地域・社会',
  '人文・歴史',
  '人権・ジェンダー',
  '国際',
  'ビジネス・経済',
  '一次産業',
  'スポーツ・教育',
  '自然環境',
  '科学・数学',
  'テクノロジー・工学',
  '健康・医療',
  'デザイン・アート',
  'くらし',
  'その他',
];

const List<List<String>> subCategoryList = [
  ['防災', '観光', '市政', '政治'],
  ['歴史', '言語', '地理', '心理', '哲学'],
  ['ジェンダー', '子供の権利', '貧困'],
  ['国際協力', '海外問題'],
  ['ビジネス', 'マーケティング', '経済', 'エシカル消費'],
  ['農業', '水産業', '林業'],
  ['スポーツ', '幼児教育', '教育'],
  ['水資源', '森資源', '生物', '地学', 'エシカル'],
  ['数学', '化学', '物理'],
  ['コンピューター', 'ロボット', '機械工学', 'ＩＣＴ'],
  ['健康', '美容', '医療'],
  ['アート', 'デザイン', '音楽'],
  ['食', '学校生活', '図書'],
];
